# Ring Dust

Nadirs are where plumes are most concentrated, saturating the INMS and CDA sensors, creating windows where sensors are more prone to error. If we have the speeds, analyses can use them to compensate for offset

In [1]:
%load_ext sql

In [2]:
import os
from dotenv import load_dotenv

In [3]:
load_dotenv("../.env")
user = os.environ.get('POSTGRES_USER')
pw = os.environ.get('POSTGRES_PASSWORD')
db_name = os.environ.get('POSTGRES_DB')
host = 'localhost'
port = 5432
conn_str = f'postgresql://{user}:{pw}@{host}:{port}/{db_name}'

In [4]:
%sql $conn_str

Create `flybys` table with timestamp and altitude, along with speed, start_time, and end_time

## Cosmic dust analyzer (CDA)

Cassini is comprised of two components - cassini deep-space probe, and huygens, a one-way lander for Titan

CDA, mounted on Cassini, is itself made of two parts - dust analyzer and high rate detector; one for big, fast particles, the other for high volume. We want dust analyzer for their physical and chemical analyses. It zaps the dusts into plasma and analyzes the zap profile

Redo the materialized view upstream to include the group by year and dates to simplify the flybys CTE

In [ ]:
%%sql
-- create view
drop materialized view if exists flyby_altitudes;
create materialized view flyby_altitudes as 
select
    (sclk::timestamp) as time_stamp,
    date_part('year', (sclk::timestamp)) as year,
    date_part('week', (sclk::timestamp)) as week,
    alt_t::numeric(10,3) as altitude
from import.inms
where target='ENCELADUS' and alt_t IS NOT NULL;

Flybys become:

In [5]:
%%sql
with lows_by_weeks as 
    (select 
        min(altitude) as alt
    from flyby_altitudes
    group by year, week 
    ), 
nadirs as (
    select 
        f.time_stamp,
        l.alt
    from lows_by_weeks l
    inner join flyby_altitudes f
    on l.alt = f.altitude
)
select 
    min(time_stamp) + (max(time_stamp) - min(time_stamp))/2 time_stamp_avg,
    alt
from nadirs
group by 
    alt -- don't group by dates a second time
order by time_stamp_avg;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[(datetime.datetime(2005, 2, 17, 3, 30, 12, 119000), Decimal('1272.075')),
 (datetime.datetime(2005, 3, 9, 9, 8, 3, 472500), Decimal('500.370')),
 (datetime.datetime(2005, 7, 14, 19, 55, 22, 330000), Decimal('168.012')),
 (datetime.datetime(2008, 3, 12, 19, 6, 11, 509000), Decimal('50.292')),
 (datetime.datetime(2008, 8, 11, 21, 6, 18, 574000), Decimal('53.353')),
 (datetime.datetime(2008, 10, 9, 19, 6, 39, 724000), Decimal('28.576')),
 (datetime.datetime(2008, 10, 31, 17, 14, 51, 429000), Decimal('173.044')),
 (datetime.datetime(2009, 11, 21, 2, 9, 56, 371000), Decimal('1596.561')),
 (datetime.datetime(2010, 5, 18, 6, 4, 40, 301000), Decimal('437.292')),
 (datetime.datetime(2010, 8, 13, 22, 30, 51, 975000), Decimal('2555.180')),
 (datetime.datetime(2010, 10, 17, 10, 47, 11, 762000), Decimal('98.901')),
 (datetime.datetime(2010, 11, 30, 11, 53, 59, 49000), Decimal('45.699')),
 (datetime.datetime(2010, 12, 21, 1, 8, 27, 146000), Decimal('48.324')),
 (datetime.datetime(2011, 4, 21, 18, 56, 21, 275000), Decimal('3771.195')),
 (datetime.datetime(2011, 10, 1, 13, 52, 25, 698000), Decimal('98.898')),
 (datetime.datetime(2011, 10, 19, 9, 22, 11, 224500), Decimal('1230.674')),
 (datetime.datetime(2011, 11, 6, 4, 58, 53, 480500), Decimal('496.603')),
 (datetime.datetime(2012, 3, 27, 18, 30, 8, 975000), Decimal('74.165')),
 (datetime.datetime(2012, 4, 14, 14, 1, 37, 811000), Decimal('74.100')),
 (datetime.datetime(2012, 5, 2, 9, 31, 28, 949000), Decimal('73.134')),
 (datetime.datetime(2015, 10, 14, 10, 41, 28, 976500), Decimal('1844.230')),
 (datetime.datetime(2015, 10, 28, 15, 22, 41, 550000), Decimal('49.010')),
 (datetime.datetime(2015, 12, 19, 17, 49, 16, 113500), Decimal('5000.200'))]

### functions

Calcs in SQL is a type of code smell. Use **functions** to abstract them out

In [ ]:
%%sql
drop function if exists low_time(
    numeric,
    double precision,
    double precision
);
create function low_time(
    alt numeric,
    yr double precision,
    wk double precision,
    out timestamp without time zone
)
as $$
    select
        min(time_stamp) + (max(time_stamp) - min(time_stamp))/2 nadir
    from flyby_altitudes f
    where f.altitude=alt
    and f.year = yr
    and f.week = wk
$$ language sql;

- drop isn't required but makes editing easier
- $$ encloses the function body
- output contains the query results

New CTE:

In [6]:
%%sql
with lows as (
    select
        year,
        week,
        min(altitude) as altitude
    from flyby_altitudes
    group by year, week
)
select 
    low_time(altitude, year, week) as time_stamp,
    altitude
from lows;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[(datetime.datetime(2011, 10, 19, 9, 22, 11, 224500), Decimal('1230.674')),
 (datetime.datetime(2008, 10, 9, 19, 6, 39, 724000), Decimal('28.576')),
 (datetime.datetime(2005, 3, 9, 9, 8, 3, 472500), Decimal('500.370')),
 (datetime.datetime(2015, 12, 19, 17, 49, 16, 113500), Decimal('5000.200')),
 (datetime.datetime(2009, 11, 21, 2, 9, 56, 371000), Decimal('1596.561')),
 (datetime.datetime(2008, 3, 12, 19, 6, 11, 509000), Decimal('50.292')),
 (datetime.datetime(2012, 4, 14, 14, 1, 37, 811000), Decimal('74.100')),
 (datetime.datetime(2012, 3, 27, 18, 30, 8, 975000), Decimal('74.165')),
 (datetime.datetime(2012, 5, 2, 9, 31, 28, 949000), Decimal('73.134')),
 (datetime.datetime(2015, 10, 28, 15, 22, 41, 550000), Decimal('49.010')),
 (datetime.datetime(2010, 11, 30, 11, 53, 59, 49000), Decimal('45.699')),
 (datetime.datetime(2005, 7, 14, 19, 55, 22, 330000), Decimal('168.012')),
 (datetime.datetime(2015, 10, 14, 10, 41, 28, 976500), Decimal('1844.230')),
 (datetime.datetime(2010, 12, 21, 1, 8, 27, 146000), Decimal('48.324')),
 (datetime.datetime(2010, 8, 13, 22, 30, 51, 975000), Decimal('2555.180')),
 (datetime.datetime(2011, 10, 1, 13, 52, 25, 698000), Decimal('98.898')),
 (datetime.datetime(2010, 5, 18, 6, 4, 40, 301000), Decimal('437.292')),
 (datetime.datetime(2008, 8, 11, 21, 6, 18, 574000), Decimal('53.353')),
 (datetime.datetime(2010, 4, 28, 0, 0, 1, 88000), Decimal('3771.195')),
 (datetime.datetime(2008, 10, 31, 17, 14, 51, 429000), Decimal('173.044')),
 (datetime.datetime(2009, 11, 2, 7, 41, 57, 707000), Decimal('98.901')),
 (datetime.datetime(2011, 11, 6, 4, 58, 53, 480500), Decimal('496.603')),
 (datetime.datetime(2005, 2, 17, 3, 30, 12, 119000), Decimal('1272.075'))]

### Flyby table

add name, start_time, end_time, and assign primary key

In [10]:
%%sql
-- for convenience
drop table if exists flybys;

-- create new table
with lows as (
    select
        year,
        week,
        min(altitude) as altitude
    from flyby_altitudes
    group by year, week
), nadirs as (
    select 
        low_time(altitude, year, week) as time_stamp,
        altitude
    from lows
    order by time_stamp
)
-- exec CTE
select 
    nadirs.*,
    null::text as name,
    null::timestamp as start_time,
    null::timestamp as end_time
-- push to new table
into flybys
from nadirs;

-- add primary key
alter table flybys
add column id serial primary key;

-- use the key to create the name
-- || concatenates and coerces to string
UPDATE flybys
SET name='E-' || id - 1;

 * postgresql://postgres:***@localhost:5432/enceladus
Done.
23 rows affected.
Done.
23 rows affected.

[]

In [11]:
%sql select * from flybys;

 * postgresql://postgres:***@localhost:5432/enceladus
23 rows affected.

[(datetime.datetime(2005, 2, 17, 3, 30, 12, 119000), Decimal('1272.075'), 'E-0', None, None, 1),
 (datetime.datetime(2005, 3, 9, 9, 8, 3, 472500), Decimal('500.370'), 'E-1', None, None, 2),
 (datetime.datetime(2005, 7, 14, 19, 55, 22, 330000), Decimal('168.012'), 'E-2', None, None, 3),
 (datetime.datetime(2008, 3, 12, 19, 6, 11, 509000), Decimal('50.292'), 'E-3', None, None, 4),
 (datetime.datetime(2008, 8, 11, 21, 6, 18, 574000), Decimal('53.353'), 'E-4', None, None, 5),
 (datetime.datetime(2008, 10, 9, 19, 6, 39, 724000), Decimal('28.576'), 'E-5', None, None, 6),
 (datetime.datetime(2008, 10, 31, 17, 14, 51, 429000), Decimal('173.044'), 'E-6', None, None, 7),
 (datetime.datetime(2009, 11, 2, 7, 41, 57, 707000), Decimal('98.901'), 'E-7', None, None, 8),
 (datetime.datetime(2009, 11, 21, 2, 9, 56, 371000), Decimal('1596.561'), 'E-8', None, None, 9),
 (datetime.datetime(2010, 4, 28, 0, 0, 1, 88000), Decimal('3771.195'), 'E-9', None, None, 10),
 (datetime.datetime(2010, 5, 18, 6, 4, 40, 301000), Decimal('437.292'), 'E-10', None, None, 11),
 (datetime.datetime(2010, 8, 13, 22, 30, 51, 975000), Decimal('2555.180'), 'E-11', None, None, 12),
 (datetime.datetime(2010, 11, 30, 11, 53, 59, 49000), Decimal('45.699'), 'E-12', None, None, 13),
 (datetime.datetime(2010, 12, 21, 1, 8, 27, 146000), Decimal('48.324'), 'E-13', None, None, 14),
 (datetime.datetime(2011, 10, 1, 13, 52, 25, 698000), Decimal('98.898'), 'E-14', None, None, 15),
 (datetime.datetime(2011, 10, 19, 9, 22, 11, 224500), Decimal('1230.674'), 'E-15', None, None, 16),
 (datetime.datetime(2011, 11, 6, 4, 58, 53, 480500), Decimal('496.603'), 'E-16', None, None, 17),
 (datetime.datetime(2012, 3, 27, 18, 30, 8, 975000), Decimal('74.165'), 'E-17', None, None, 18),
 (datetime.datetime(2012, 4, 14, 14, 1, 37, 811000), Decimal('74.100'), 'E-18', None, None, 19),
 (datetime.datetime(2012, 5, 2, 9, 31, 28, 949000), Decimal('73.134'), 'E-19', None, None, 20),
 (datetime.datetime(2015, 10, 14, 10, 41, 28, 976500), Decimal('1844.230'), 'E-20', None, None, 21),
 (datetime.datetime(2015, 10, 28, 15, 22, 41, 550000), Decimal('49.010'), 'E-21', None, None, 22),
 (datetime.datetime(2015, 12, 19, 17, 49, 16, 113500), Decimal('5000.200'), 'E-22', None, None, 23)]

## CDA Data Audit

`cda_manifest.md`:

- describes the data
- designates units, type, precision and length
- gives default for each field


Main takeaways:

- UTC time
- `Missing Constant` - placeholder data?
- units are important, and should be in column name
- placeholder data, indicated by "Will be supplied in later delivery", are omitted

### importing as text first

Make `import.sql` as opposed to Makefile to import the CDA csv

- bring to `import` schema
- default to `TEXT` format; wrangle after import
- the file path must respect the mount directory inside the docker container, if we're running a dockerized instance of PG
    - `proj_root/curious/` is mounted to container's `/home/curious/`

In [14]:
from pathlib import Path

In [25]:
cda_csv_path = str(Path('/home/curious/data/CDA/cda.csv').resolve())
print(cda_csv_path)

/home/curious/data/CDA/cda.csv

In [26]:
%%sql
-- convenience
DROP TABLE IF EXISTS import.cda;
-- schema, omitting the placeholder data columns
CREATE TABLE import.cda(
    event_id text,
    impact_event_time text,
    impact_event_julian_date text,
    qp_amplitude text,
    qi_amplitude text,
    qt_amplitude text,
    qc_amplitude text,
    spacecraft_sun_distance text,
    spacecraft_saturn_distance text,
    spacecraft_x_velocity text,
    spacecraft_y_velocity text,
    spacecraft_z_velocity text,
    counter_number text,
    particle_mass text,
    particle_charge text
);
-- copy data
COPY import.cda
FROM :cda_csv_path
DELIMITER ',' HEADER CSV;

 * postgresql://postgres:***@localhost:5432/enceladus
Done.
Done.
440510 rows affected.

[]

### Transforming to proper types

This is where the manifest comes in

In [29]:
%%sql
DROP SCHEMA IF EXISTS cda cascade;
CREATE SCHEMA cda;
SELECT
    event_id::integer as id,
    impact_event_time::timestamp as time_stamp,
    impact_event_time::date as impact_date,
    counter_number::integer,
    spacecraft_sun_distance::numeric(6,4) as sun_distance_au,
    spacecraft_saturn_distance::numeric(8,2) as saturn_distance_rads,
    spacecraft_x_velocity::numeric(6,2) as x_velocity,
    spacecraft_y_velocity::numeric(6,2) as y_velocity,
    spacecraft_z_velocity::numeric(6,2) as z_velocity,
    particle_charge::numeric(4,1),
    particle_mass::numeric(4,1)
FROM import.cda
ORDER BY impact_event_time::timestamp;

 * postgresql://postgres:***@localhost:5432/enceladus
Done.
Done.
(psycopg2.errors.InvalidTextRepresentation) invalid input syntax for type integer: "**"

[SQL: SELECT
    event_id::integer as id,
    impact_event_time::timestamp as time_stamp,
    impact_event_time::date as impact_date,
    counter_number::integer,
    spacecraft_sun_distance::numeric(6,4) as sun_distance_au,
    spacecraft_saturn_distance::numeric(8,2) as saturn_distance_rads,
    spacecraft_x_velocity::numeric(6,2) as x_velocity,
    spacecraft_y_velocity::numeric(6,2) as y_velocity,
    spacecraft_z_velocity::numeric(6,2) as z_velocity,
    particle_charge::numeric(4,1),
    particle_mass::numeric(4,1)
FROM import.cda
ORDER BY impact_event_time::timestamp;]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

Someone put `**` as a placeholder in one of our numeric fields

Proper way is to delve into the source and find out what it really represents. For now use `CASE` to import `counter_number` as `NULL` if it shows up again. We also know it's `counter_number` since it's the only field we're importing as `integer`

In [32]:
%%sql
DROP SCHEMA IF EXISTS cda cascade;
CREATE SCHEMA cda;
SELECT
    event_id::integer as id,
    impact_event_time::timestamp as time_stamp,
    impact_event_time::date as impact_date,
    CASE WHEN counter_number = '**' THEN NULL
    ELSE counter_number::integer
    END AS counter_number,
    spacecraft_sun_distance::numeric(6,4) as sun_distance_au,
    spacecraft_saturn_distance::numeric(8,2) as saturn_distance_rads,
    spacecraft_x_velocity::numeric(6,2) as x_velocity,
    spacecraft_y_velocity::numeric(6,2) as y_velocity,
    spacecraft_z_velocity::numeric(6,2) as z_velocity,
    particle_charge::numeric(4,1),
    particle_mass::numeric(4,1)
INTO cda.impacts
FROM import.cda
ORDER BY impact_event_time::timestamp;

-- add key
ALTER TABLE cda.impacts
ADD id SERIAL PRIMARY KEY;

 * postgresql://postgres:***@localhost:5432/enceladus
Done.
Done.
440510 rows affected.
(psycopg2.errors.DuplicateColumn) column "id" of relation "impacts" already exists

[SQL: -- add key
ALTER TABLE cda.impacts
ADD id SERIAL PRIMARY KEY;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [33]:
%%sql
select * from cda.impacts
WHERE x_velocity <> -99.99
limit 5;

 * postgresql://postgres:***@localhost:5432/enceladus
5 rows affected.

[(398120, datetime.datetime(2005, 1, 1, 0, 2, 42), datetime.date(2005, 1, 1), 37, Decimal('9.0501'), Decimal('59.63'), Decimal('-8.38'), Decimal('-4.45'), Decimal('-1.08'), Decimal('0.0'), Decimal('0.0')),
 (398121, datetime.datetime(2005, 1, 1, 0, 4, 55), datetime.date(2005, 1, 1), 19, Decimal('9.0501'), Decimal('59.63'), Decimal('-8.38'), Decimal('-4.45'), Decimal('-1.08'), Decimal('0.0'), Decimal('0.0')),
 (398122, datetime.datetime(2005, 1, 1, 0, 7, 36), datetime.date(2005, 1, 1), 37, Decimal('9.0501'), Decimal('59.63'), Decimal('-8.38'), Decimal('-4.45'), Decimal('-1.08'), Decimal('0.0'), Decimal('0.0')),
 (398123, datetime.datetime(2005, 1, 1, 0, 9, 24), datetime.date(2005, 1, 1), 37, Decimal('9.0501'), Decimal('59.63'), Decimal('-8.38'), Decimal('-4.45'), Decimal('-1.08'), Decimal('0.0'), Decimal('0.0')),
 (398124, datetime.datetime(2005, 1, 1, 0, 13, 5), datetime.date(2005, 1, 1), 37, Decimal('9.0501'), Decimal('59.63'), Decimal('-8.38'), Decimal('-4.45'), Decimal('-1.08'), Decimal('0.0'), Decimal('0.0'))]

## Cassini's speed

The x, y, z velocities are the *J2000 heliocentric equatorial* components. We can get the actual speed with Pythagorean's theorem. However, this is all relative to the sun. We're probably interested in speeds relative to Enceladus

In [34]:
%%sql
-- sql func for pythagorean
DROP FUNCTION IF EXISTS pythag3(
    numeric,
    numeric,
    numeric
);
CREATE FUNCTION pythag3(
    x NUMERIC,
    y NUMERIC,
    z NUMERIC,
    out NUMERIC)
AS $$
    SELECT SQRT(
        (x * x) + (y * y) + (z * z)
    )::numeric(10, 2);
$$
language sql;

 * postgresql://postgres:***@localhost:5432/enceladus
Done.
Done.

[]

In [36]:
%%sql
SELECT impact_date,
pythag3(x_velocity, y_velocity, z_velocity) as v_kms
from cda.impacts
where x_velocity <> -99.99
limit 5;

 * postgresql://postgres:***@localhost:5432/enceladus
5 rows affected.

[(datetime.date(2005, 1, 1), Decimal('9.55')),
 (datetime.date(2005, 1, 1), Decimal('9.55')),
 (datetime.date(2005, 1, 1), Decimal('9.55')),
 (datetime.date(2005, 1, 1), Decimal('9.55')),
 (datetime.date(2005, 1, 1), Decimal('9.55'))]

In [61]:
%%sql
with target_count as(
    select 
        DISTINCT t.description target,
        COUNT(*) OVER () AS total,
        COUNT(*) OVER (PARTITION BY t.description) AS subtotal
    from events e
    join targets t
    on e.target_id = t.id
) 
SELECT
    target, subtotal, (100 * subtotal / total::float)::numeric(4,2) as pcnt
FROM target_count
ORDER BY subtotal DESC;

 * postgresql://postgres:***@localhost:5432/enceladus
46 rows affected.

[('Saturn', 16958, Decimal('27.41')),
 ('Titan', 9503, Decimal('15.36')),
 ('Other', 5961, Decimal('9.63')),
 ('rings(general)', 5808, Decimal('9.39')),
 ('InstrumentCalibration', 4549, Decimal('7.35')),
 ('SolarWind', 4041, Decimal('6.53')),
 ('DustRAM direction', 2678, Decimal('4.33')),
 ('co-rotation', 2677, Decimal('4.33')),
 ('Enceladus', 1626, Decimal('2.63')),
 ('Sun', 1079, Decimal('1.74')),
 ('Rhea', 964, Decimal('1.56')),
 ('Star', 796, Decimal('1.29')),
 ('Dione', 780, Decimal('1.26')),
 ('Iapetus', 682, Decimal('1.10')),
 ('Tethys', 634, Decimal('1.02')),
 ('Mimas', 504, Decimal('0.81')),
 ('Earth', 478, Decimal('0.77')),
 ('RingE', 392, Decimal('0.63')),
 ('RingF', 388, Decimal('0.63')),
 ('Hyperion', 304, Decimal('0.49')),
 ('Phoebe', 181, Decimal('0.29')),
 ('RingB', 144, Decimal('0.23')),
 ('RingA', 131, Decimal('0.21')),
 ('SpacecraftActivity', 114, Decimal('0.18')),
 ('RingC', 109, Decimal('0.18')),
 ('Janus', 68, Decimal('0.11')),
 ('RingG', 65, Decimal('0.11')),
 ('Epimetheus', 52, Decimal('0.08')),
 ('NotApplicable', 34, Decimal('0.05')),
 ('Helene', 31, Decimal('0.05')),
 ('Telesto', 22, Decimal('0.04')),
 ('Pandora', 15, Decimal('0.02')),
 ('Calypso', 12, Decimal('0.02')),
 ('Methone', 12, Decimal('0.02')),
 ('Skeletonrequest', 10, Decimal('0.02')),
 ('Atlas', 9, Decimal('0.01')),
 ('Pallene', 9, Decimal('0.01')),
 ('Polydeuces', 8, Decimal('0.01')),
 ('Prometheus', 8, Decimal('0.01')),
 ('Daphnis', 8, Decimal('0.01')),
 ('SpacecraftRAM direction', 7, Decimal('0.01')),
 ('Jupiter', 6, Decimal('0.01')),
 ('Pan', 6, Decimal('0.01')),
 ('RingD', 5, Decimal('0.01')),
 ('Aegaeon', 4, Decimal('0.01')),
 ('Anthe', 1, Decimal('0.00'))]

In [42]:
%%sql
select table_name, column_name
from information_schema.columns
where table_name in ('targets', 'events')
order by table_name

 * postgresql://postgres:***@localhost:5432/enceladus
11 rows affected.

[('events', 'team_id'),
 ('events', 'request_id'),
 ('events', 'spass_type_id'),
 ('events', 'time_stamp'),
 ('events', 'description'),
 ('events', 'title'),
 ('events', 'id'),
 ('events', 'event_type_id'),
 ('events', 'target_id'),
 ('targets', 'id'),
 ('targets', 'description')]

## Why Postgres

### ACID

- Atomic
- Consistent
- Isolated
- Durable

Those 4 things mean that if we (the client) receives an 'ack' from the database server, that means the transaction is on disk. This is nontrivial for a concurrent system. Many other DBMS cannot make this guarantee. MySQL can only do so with InnoDB engine

### Locking and MVCC

MySQL will lock records when they're part of a write transaction, until it completes. All subsequent queries on those records must wait until lock is lifted, else error code 1205 is raised

Twitter once tried to add a flag to all users in db

```sql
UPDATE users
set new_flag=1
```

and it crashed their website since all user data was locked

Postgres locks only as a fallback measure; instead it uses multi-version concurrency control (MVCC): all changes occur in a virtual *staging* area, and once the writes complete, the entire change is written to disk in one operation. This means that read is still allowed. Writes will be queued until the prior write finished

### Enterprise features

- table compression
- concurrent indexing (vs single process)
- partitioning
- friendly help messages

### Json

Postgres stores JSON in binary, JSONB. It can be indexed on specific keys or the whole doc. It is good at storing this format.

Downside vs MongoDB is query performance and useability. Thus there are tools that mimic MongoDB API when using postgres to store JSON

- MassiveJS
- Moebius
- dox